; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v9 ?v10)
             (pred_10 ?v5 ?v12)
             (pred_8 ?v9 ?v12)
             (pred_6 ?v7 ?v9 )
	     (pred_7 ?v9)
             (pred_4 ?v2)
             (pred_2 ?v5)
             (pred_12 ?v12)
             (pred_1 ?v9)
             (pred_9 ?v5)
             (pred_11 ?v9)
             (pred_5 ))



(:action op_3
:parameters (?v6 ?v13 ?v11 ?v1)
:precondition (and (pred_4 ?v6) (pred_4 ?v13) (pred_2 ?v11) (pred_12 ?v1)
          (pred_3 ?v6 ?v13) (pred_10 ?v11 ?v1)
                   (pred_8 ?v13 ?v1) (pred_7 ?v6) 
                   (pred_1 ?v13) (pred_9 ?v11))
:effect (and  (pred_11 ?v13) (not (pred_1 ?v13))))


(:action op_5
:parameters (?v6 ?v8)
:precondition (and (pred_4 ?v6) (pred_4 ?v8)
               (pred_7 ?v6) (pred_3 ?v6 ?v8) (pred_11 ?v8))
:effect (and (pred_7 ?v8) (not (pred_7 ?v6))))

(:action op_4
:parameters (?v6 ?v11)
:precondition (and (pred_4 ?v6) (pred_2 ?v11) 
                  (pred_7 ?v6) (pred_6 ?v11 ?v6) (pred_5 ))
:effect (and (pred_9 ?v11)
   (not (pred_6 ?v11 ?v6)) (not (pred_5 ))))


(:action op_1
:parameters (?v6 ?v4 ?v3)
:precondition (and (pred_4 ?v6) (pred_2 ?v4) (pred_2 ?v3)
                  (pred_7 ?v6) (pred_9 ?v3) (pred_6 ?v4 ?v6))
:effect (and (pred_9 ?v4) (pred_6 ?v3 ?v6)
        (not (pred_9 ?v3)) (not (pred_6 ?v4 ?v6))))

(:action op_2
:parameters (?v6 ?v11)
:precondition (and (pred_4 ?v6) (pred_2 ?v11) 
                  (pred_7 ?v6) (pred_9 ?v11))
:effect (and (pred_5 ) (pred_6 ?v11 ?v6) (not (pred_9 ?v11)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_17 obj_14 obj_13 obj_18 obj_07 obj_08 obj_11 obj_03 obj_01 obj_04 obj_05 obj_19 obj_06 obj_15 obj_20 obj_02
    obj_21 obj_16
    obj_10 obj_09 obj_12
    )

    (:init
       (pred_5)

       (pred_4 obj_17)
       (pred_4 obj_14)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_07)
       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_03)
       (pred_4 obj_01)
       (pred_4 obj_04)
       (pred_4 obj_05)
       (pred_4 obj_19)
       (pred_4 obj_06)
       (pred_4 obj_15)
       (pred_4 obj_20)
       (pred_4 obj_02)
       (pred_12 obj_21)
       (pred_12 obj_16)
       (pred_2 obj_10)
       (pred_2 obj_09)
       (pred_2 obj_12)

       (pred_3 obj_17 obj_07)
       (pred_3 obj_17 obj_14)
       (pred_3 obj_14 obj_08)
       (pred_3 obj_14 obj_13)
       (pred_3 obj_14 obj_17)
       (pred_3 obj_13 obj_11)
       (pred_3 obj_13 obj_18)
       (pred_3 obj_13 obj_14)
       (pred_3 obj_18 obj_03)
       (pred_3 obj_18 obj_13)
       (pred_3 obj_07 obj_01)
       (pred_3 obj_07 obj_08)
       (pred_3 obj_07 obj_17)
       (pred_3 obj_08 obj_04)
       (pred_3 obj_08 obj_11)
       (pred_3 obj_08 obj_14)
       (pred_3 obj_08 obj_07)
       (pred_3 obj_11 obj_05)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_11 obj_13)
       (pred_3 obj_11 obj_08)
       (pred_3 obj_03 obj_19)
       (pred_3 obj_03 obj_18)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_01 obj_06)
       (pred_3 obj_01 obj_04)
       (pred_3 obj_01 obj_07)
       (pred_3 obj_04 obj_15)
       (pred_3 obj_04 obj_05)
       (pred_3 obj_04 obj_08)
       (pred_3 obj_04 obj_01)
       (pred_3 obj_05 obj_20)
       (pred_3 obj_05 obj_19)
       (pred_3 obj_05 obj_11)
       (pred_3 obj_05 obj_04)
       (pred_3 obj_19 obj_02)
       (pred_3 obj_19 obj_03)
       (pred_3 obj_19 obj_05)
       (pred_3 obj_06 obj_15)
       (pred_3 obj_06 obj_01)
       (pred_3 obj_15 obj_20)
       (pred_3 obj_15 obj_04)
       (pred_3 obj_15 obj_06)
       (pred_3 obj_20 obj_02)
       (pred_3 obj_20 obj_05)
       (pred_3 obj_20 obj_15)
       (pred_3 obj_02 obj_19)
       (pred_3 obj_02 obj_20)
       (pred_1 obj_08)
       (pred_1 obj_07)
       (pred_1 obj_14)
       (pred_8  obj_08 obj_21)
       (pred_8  obj_07 obj_16)
       (pred_8  obj_14 obj_16)
       (pred_11 obj_17)
       (pred_11 obj_13)
       (pred_11 obj_18)
       (pred_11 obj_11)
       (pred_11 obj_03)
       (pred_11 obj_01)
       (pred_11 obj_04)
       (pred_11 obj_05)
       (pred_11 obj_19)
       (pred_11 obj_06)
       (pred_11 obj_15)
       (pred_11 obj_20)
       (pred_11 obj_02)

       (pred_10  obj_10 obj_21)
       (pred_10  obj_09 obj_16)
       (pred_10  obj_12 obj_21)
       (pred_6 obj_10 obj_06)
       (pred_6 obj_09 obj_02)
       (pred_6 obj_12 obj_02)
       (pred_7 obj_13)
    )

    (:goal (and
       (pred_6 obj_10 obj_19)
    ))
(:constraints
  (always (not (pred_7 obj_05)))
)
)

; plan
1. (op_5 obj_13 obj_11)
   deleted: (pred_7 obj_13)
   added: (pred_7 obj_11)
   goals met: 0 of 1
2. (op_5 obj_11 obj_03)
   deleted: (pred_7 obj_11)
   added: (pred_7 obj_03)
   goals met: 0 of 1
3. (op_5 obj_03 obj_19)
   deleted: (pred_7 obj_03)
   added: (pred_7 obj_19)
   goals met: 0 of 1
4. (op_5 obj_19 obj_02)
   deleted: (pred_7 obj_19)
   added: (pred_7 obj_02)
   goals met: 0 of 1
5. (op_5 obj_02 obj_20)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_20)
   goals met: 0 of 1
6. (op_5 obj_20 obj_15)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_15)
   goals met: 0 of 1
7. (op_5 obj_15 obj_06)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_06)
   goals met: 0 of 1
8. (op_4 obj_06 obj_10)
   deleted: (pred_6 obj_10 obj_06) (pred_5)
   added: (pred_9 obj_10)
   goals met: 0 of 1
9. (op_5 obj_06 obj_15)
   deleted: (pred_7 obj_06)
   added: (pred_7 obj_15)
   goals met: 0 of 1
10. (op_5 obj_15 obj_20)
   deleted: (pred_7 obj_15)
   added: (pred_7 obj_20)
   goals met: 0 of 1
11. (op_5 obj_20 obj_02)
   deleted: (pred_7 obj_20)
   added: (pred_7 obj_02)
   goals met: 0 of 1
12. (op_5 obj_02 obj_19)
   deleted: (pred_7 obj_02)
   added: (pred_7 obj_19)
   goals met: 0 of 1
13. (op_2 obj_19 obj_10)
   deleted: (pred_9 obj_10)
   added: (pred_5) (pred_6 obj_10 obj_19)
   goals met: 1 of 1
